Tekla Open API Reference for Tekla Structures 2025
Drawing.UpToDateStatus Property
 Gets the drawing up to date status.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingUpToDateStatus UpToDateStatus { get; }
Public ReadOnly Property UpToDateStatus As DrawingUpToDateStatus
	Get
Property Value
Type: DrawingUpToDateStatus
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace